/*
Напишите программу, которая на вход принимает число и выдает его квадрат 
(число умноженное на само себя).
Например:
● 4 -> 16
● -3 -> 9
● -7 -> 49\
*/

string input = Console.ReadLine();

int number = int.Parse(input);

Console.WriteLine(number * number);
















